snlkuharlocal/src/DataProcessors/МП_ММ_Озон/МП_ММ_Озон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МП_ММ_Озон</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/МП_ДанныеЗаказовСервиса/МП_ДанныеЗаказовСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_ДанныеЗаказовСервиса</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Интервал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаказПоЮрЛицу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВнешнийИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МаркетПлейс</name>
    <type>
      <types>CatalogRef.ИнетМагазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ЗаказКлиентаFBS</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/МП_ДанныеНоменклатурыЗаказовСервиса/МП_ДанныеНоменклатурыЗаказовСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_ДанныеНоменклатурыЗаказовСервиса</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтикеткаСформирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПосылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеУКлиента</name>
    <type>
      <types>CatalogRef.СостояниеНакладнойУКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКЭтикетке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВнешнийИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МаркетПлейс</name>
    <type>
      <types>CatalogRef.ИнетМагазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШККонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ЗаказКлиентаFBS/ЗаказКлиентаFBS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиентаFBS</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистПереукладки</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусWB</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеУКлиента</name>
      <type>
        <types>CatalogRef.СостояниеНакладнойУКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаОтработана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркОфис</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданоНаСайт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/МП_ММ_Озон/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// МП обработать загрузку заказов порционно.
// 
// Параметры:
//  ПараметрыОбработки - Структура - Параметры обработки
//  РезультатыЗапроса - Массив Из РезультатЗапроса - Результаты запроса
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркет плейс
Процедура МП_ОбработатьЗагрузкуЗаказовПорционно(ПараметрыОбработки, РезультатыЗапроса, РеквизитыМаркетПлейс) Экспорт
	
	// Инициализация
	ПараметрыОтбора = Новый Структура;
	
	НаборЗаписейДанныеЗаказов = ОбменМаркетПлейс.ПолучитьДанныеНабораРегистраСведенийПоДаннымМаркетплейса(
		ПараметрыОбработки.МаркетПлейс, "МП_ДанныеЗаказовСервиса",
		РезультатыЗапроса[РезультатыЗапроса.ВГраница() - 1]);
	НаборЗаписейДанныеТоваров = ОбменМаркетПлейс.ПолучитьДанныеНабораРегистраСведенийПоДаннымМаркетплейса(
		ПараметрыОбработки.МаркетПлейс, "МП_ДанныеНоменклатурыЗаказовСервиса",
		РезультатыЗапроса[РезультатыЗапроса.ВГраница()]);
	
	СмещениеПакетаЗапроса_ДанныеЗаказов = 5;
	Выборка = РезультатыЗапроса[СмещениеПакетаЗапроса_ДанныеЗаказов - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПараметрыОбработки.ДополнительныеПараметры.Json = Новый Структура;
	ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("filter", Новый Структура);
	ПараметрыОбработки.ДополнительныеПараметры.Json.filter.Вставить("since",
		ЗаписатьДатуJSON(ПараметрыОбработки.ДатаНачала, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата));
	ПараметрыОбработки.ДополнительныеПараметры.Json.filter.Вставить("to",
		ЗаписатьДатуJSON(ПараметрыОбработки.ДатаОкончания, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата));
	ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("limit", 100);
	ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("cursor", "");
	ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("with", Новый Структура);
	ПараметрыОбработки.ДополнительныеПараметры.Json.with.Вставить("analytics_data", Истина);
	ПараметрыОбработки.ДополнительныеПараметры.Json.with.Вставить("barcodes", Истина);
	
	Пока Истина Цикл
		СтруктураДанныхОтвета = КоннекторHTTP.Post(СтрШаблон("https://%1%2", РеквизитыМаркетПлейс.Host,
			МП_АдресЗапроса_СписокЗаказов()),, ПараметрыОбработки.ДополнительныеПараметры);
		ДанныеОтвета = КоннекторHTTP.КакJson(СтруктураДанныхОтвета,
			ПараметрыОбработки.ДополнительныеПараметры.ПараметрыПреобразованияJSON);
		Если Не СтруктураДанныхОтвета.Свойство("КодСостояния")
			Или СтруктураДанныхОтвета.КодСостояния > 400 Тогда
			ВызватьИсключение "Ошибка получения данных по заказам";
		КонецЕсли;
		
		МассивЗаказов = ДанныеОтвета[ПараметрыОбработки.ИменаСтруктурДанных.ТелоЗаказа];
		Для каждого ДанныеЗаказа из МассивЗаказов Цикл
			ПараметрыОбработки.АгрегируемыеПоля.Сумма = 0;
			
			// Ихсанов Д. А. Начало 18.06.2026 Изменение 0000000070 от 05.06.2026 10:46:32: e1cib/data/Документ.Изменение?ref=89690050568f680711f160b2a681657e
			ДатаПриемки = ДанныеЗаказа[ПараметрыОбработки.ИменаПолей.ДатаСоздания] + 12 * 60 * 60;
			ПараметрыОбработки.АгрегируемыеПоля.Интервал = ОбменМаркетПлейс.ПолучитьВремяПриемкиИзДатыЗагрузки(
				ДеньНедели(ДатаПриемки), Час(ДатаПриемки), ДатаПриемки);
			// Ихсанов Д. А. Конец 18.06.2026
			
			ДвижениеДанныеЗаказов = НаборЗаписейДанныеЗаказов.Добавить();
			ДвижениеДанныеЗаказов.Период = Выборка.ДатаСоздания;
			ДвижениеДанныеЗаказов.МаркетПлейс = ПараметрыОбработки.МаркетПлейс;
			
			ПараметрыОтбора.Очистить();
			ПараметрыОтбора.Вставить("ВнешнийИдентификатор",
				Строка(ДанныеЗаказа[ПараметрыОбработки.ИменаПолей.ВнешнийИдентификатор]));
			Если Выборка.НайтиСледующий(ПараметрыОтбора) Тогда
				ЗаполнитьЗначенияСвойств(ДвижениеДанныеЗаказов, Выборка);
			КонецЕсли;
			
			ОбменМаркетПлейс.ЗаполнитьПоляКоллекцииПоВложенности(ПараметрыОбработки.ИменаПолей, ДанныеЗаказа,
				ДвижениеДанныеЗаказов);
			
			ВыборкаИдентификаторыЗаказа = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			// Особенность маркетплейса - работа с монозаказами
			МассивТоваров = ДанныеЗаказа[ПараметрыОбработки.ИменаСтруктурДанных.Товары];
			Если МассивТоваров.Количество() > 1 Тогда
				Продолжить;
			КонецЕсли;
			
			СмещениеПоТовару = 1;
			Для каждого Товар из МассивТоваров Цикл
				ПараметрыОтбора.Очистить();
				ПараметрыОтбора.Вставить("Идентификатор",
					Строка(Товар[ПараметрыОбработки.ИменаПолейТоваров.Идентификатор]));
				
				ВыборкаИдентификаторыЗаказа.НайтиСледующий(ПараметрыОтбора);
				
				ВыборкаДетальныеЗаписи = ВыборкаИдентификаторыЗаказа.Выбрать();
				КоличествоТовара = Товар[ПараметрыОбработки.ИменаПолейТоваров.Количество];
				Для Индекс = 1 ПО КоличествоТовара Цикл
					ДвижениеДанныеТоваров = НаборЗаписейДанныеТоваров.Добавить();
					ДвижениеДанныеТоваров.МаркетПлейс = ПараметрыОбработки.МаркетПлейс;
					
					Если ВыборкаДетальныеЗаписи.НайтиСледующий(ПараметрыОтбора) Тогда
						ЗаполнитьЗначенияСвойств(ДвижениеДанныеТоваров, ВыборкаДетальныеЗаписи);
					КонецЕсли;
					
					ОбменМаркетПлейс.ЗаполнитьПоляКоллекцииПоВложенности(ПараметрыОбработки.ИменаПолейТоваров, Товар,
						ДвижениеДанныеТоваров);
					ОбменМаркетПлейс.ЗаполнитьПоляКоллекцииПоВложенности(ПараметрыОбработки.ПоляТовараИзДанныхЗаказа,
						ДанныеЗаказа, ДвижениеДанныеТоваров);
					
					ПараметрыОбработки.АгрегируемыеПоляТовара.СостояниеУКлиента = 
						ПараметрыОбработки.ХешТаблицаСтатусов[СтрШаблон(
							"%1;%2", ДвижениеДанныеТоваров.Статус, ДвижениеДанныеТоваров.ДополнительныйСтатус)];
					Для каждого пПолеТовара из ПараметрыОбработки.АгрегируемыеПоляТовара Цикл
						ДвижениеДанныеТоваров[пПолеТовара.Ключ] = пПолеТовара.Значение;
					КонецЦикла;
					
					ПараметрыОбработки.АгрегируемыеПоля.Сумма = ПараметрыОбработки.АгрегируемыеПоля.Сумма
						+ ДвижениеДанныеТоваров.Цена;
					
					СмещениеПоТовару = СмещениеПоТовару + 1;
				КонецЦикла;
				
				ВыборкаДетальныеЗаписи.Сбросить();
			КонецЦикла;
			
			Для каждого пПолеЗаказа из ПараметрыОбработки.АгрегируемыеПоля Цикл
				ДвижениеДанныеЗаказов[пПолеЗаказа.Ключ] = пПолеЗаказа.Значение;
			КонецЦикла;
			
			Выборка.Сбросить();
		КонецЦикла;
		
		Если ДанныеОтвета.Свойство("has_next") И ДанныеОтвета.has_next Тогда
			ПараметрыОбработки.ДополнительныеПараметры.Json.cursor = ДанныеОтвета.cursor;
		Иначе
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	// Очень редко возникают ситуации, когда необходимо контролировать уникальность
	ОбменМаркетПлейс.ВыполнитьГруппировкуЗаписейПоНабору(НаборЗаписейДанныеЗаказов, "Сумма");
	ОбменМаркетПлейс.ВыполнитьГруппировкуЗаписейПоНабору(НаборЗаписейДанныеТоваров, "Количество");
	
	Попытка
		НаборЗаписейДанныеЗаказов.Записать();
		НаборЗаписейДанныеТоваров.Записать();
	Исключение
		ЗаписатьВЛог("МП_Озон", СтрШаблон("Не была записана информация по заказам по причине: %1",
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())), "Ошибка", Истина);
	КонецПопытки;
	
КонецПроцедуры // МП_ОбработатьЗагрузкуЗаказовПорционно()

// Процедура - Создать документы заказов и накладных
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура параметров обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура СоздатьДокументыЗаказовИНакладных(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	// Ихсанов Д. А. Начало 18.06.2026 Изменение 0000000070 от 05.06.2026 10:46:32: e1cib/data/Документ.Изменение?ref=89690050568f680711f160b2a681657e
	ТекущаяДата = ТекущаяДатаСеанса();
	// Ихсанов Д. А. Конец 18.06.2026
	
	// Получаем данные по заказам, по которым нет документа заказ клиента FBS
	// Если нет заказа, то нет и расходной накладной
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕСТЬNULL(ЗаказКлиентаFBSТовары.Ссылка, ПредварительныйЗаказКлиентаТовары.Ссылка) КАК Ссылка,
	|	вт_СериализированныеДанныеЗаказов.ДатаСоздания КАК ДатаСоздания,
	|	вт_СериализированныеДанныеЗаказов.ДатаОтгрузки КАК ДатаОтгрузки,
	|	НАЧАЛОПЕРИОДА(вт_СериализированныеДанныеЗаказов.ДатаОтгрузки, ДЕНЬ) КАК ДеньДатыОтгрузки,
	|	вт_СериализированныеДанныеЗаказов.НомерЗаказа КАК ИДЗаказа,
	|	0 КАК КолНеТовар,
	|	вт_СериализированныеДанныеЗаказов.ШтрихКод КАК ШтрихКод,
	|	вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор КАК РИД,
	|	вт_СериализированныеДанныеЗаказов.Номенклатура КАК Номенклатура,
	|	вт_СериализированныеДанныеЗаказов.Идентификатор КАК АртКонтра,
	|	вт_СериализированныеДанныеЗаказов.Цена КАК СуммаЗак,
	|	вт_СериализированныеДанныеЗаказов.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НомРП1,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НомРП2,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НомРП3,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НомРП4,
	|	вт_СериализированныеДанныеЗаказов.НомерОтгрузки КАК ПрефиксЗаказа,
	|	вт_СериализированныеДанныеЗаказов.НомерПосылки КАК СуффиксЗаказа,
	|	вт_СериализированныеДанныеЗаказов.СостояниеУКлиента КАК СостояниеУКлиента,
	|	вт_СериализированныеДанныеЗаказов.ЗаказПоЮрЛицу КАК ЗаказПоЮрЛицу,
	|	0 КАК НДС,
	|	0 КАК Всего,
	|	ЕСТЬNULL(вт_СериализированныеДанныеЗаказов.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ПОМЕСТИТЬ вт_ДанныеДляФормированияДокументов
	|ИЗ
	|	вт_СериализированныеДанныеЗаказов КАК вт_СериализированныеДанныеЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|		ПО вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор = ЗаказКлиентаFBSТовары.РИД
	|			И (НЕ ЗаказКлиентаFBSТовары.Ссылка.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительныйЗаказКлиента.Товары КАК ПредварительныйЗаказКлиентаТовары
	|		ПО вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор = ПредварительныйЗаказКлиентаТовары.РИД
	|			И (НЕ ПредварительныйЗаказКлиентаТовары.Ссылка.ПометкаУдаления)
	|ГДЕ
	|	ЗаказКлиентаFBSТовары.Ссылка ЕСТЬ NULL
	|	И ПредварительныйЗаказКлиентаТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДанныеДляФормированияДокументов.РИД КАК РИД,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_ДанныеДляФормированияДокументов.ИДЗаказа) КАК КоличествоЭкземпляров
	|ПОМЕСТИТЬ вт_КоличествоЭкзепляровНаЗаказ
	|ИЗ
	|	вт_ДанныеДляФормированияДокументов КАК вт_ДанныеДляФормированияДокументов
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_ДанныеДляФормированияДокументов.РИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДанныеДляФормированияДокументов.*,
	|	вт_КоличествоЭкзепляровНаЗаказ.КоличествоЭкземпляров
	|ИЗ
	|	вт_ДанныеДляФормированияДокументов КАК вт_ДанныеДляФормированияДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_КоличествоЭкзепляровНаЗаказ КАК вт_КоличествоЭкзепляровНаЗаказ
	|		ПО вт_ДанныеДляФормированияДокументов.РИД = вт_КоличествоЭкзепляровНаЗаказ.РИД
	|ГДЕ
	|	вт_КоличествоЭкзепляровНаЗаказ.КоличествоЭкземпляров = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДанныеДляФормированияДокументов.*,
	|	вт_КоличествоЭкзепляровНаЗаказ.КоличествоЭкземпляров
	|ИЗ
	|	вт_ДанныеДляФормированияДокументов КАК вт_ДанныеДляФормированияДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_КоличествоЭкзепляровНаЗаказ КАК вт_КоличествоЭкзепляровНаЗаказ
	|		ПО вт_ДанныеДляФормированияДокументов.РИД = вт_КоличествоЭкзепляровНаЗаказ.РИД
	|ГДЕ
	|	вт_КоличествоЭкзепляровНаЗаказ.КоличествоЭкземпляров > 1");
	Запрос.УстановитьПараметр("ТекущаяДата", ПараметрыОбработки.ДатаЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	Для Индекс = МассивРезультатовЗапроса.ВГраница() - 1 По МассивРезультатовЗапроса.ВГраница() Цикл
		РезультатЗапроса = МассивРезультатовЗапроса[Индекс];
		
		ТаблицаДанныхПоЗаказам = РезультатЗапроса.Выгрузить();
		
		// Ихсанов Д. А. Начало 18.06.2026 Изменение 0000000070 от 05.06.2026 10:46:32: e1cib/data/Документ.Изменение?ref=89690050568f680711f160b2a681657e
		// Добавлена константа часа перехода даты отгрузки
		ЧасПереходаДатыОтгрузки = Константы.ЧасПереходаДатыОтгрузки.Получить();
		Если Не ЗначениеЗаполнено(ЧасПереходаДатыОтгрузки) Тогда
			ВызватьИсключение "Не заполнен час перехода даты отгруки!"
		КонецЕсли;
		
		ДеньДатыОтгрузки = НачалоДня(ТекущаяДата);
		Если Час(ТекущаяДатаСеанса()) > ЧасПереходаДатыОтгрузки Тогда
			ДеньДатыОтгрузки = КонецДня(ТекущаяДата) + 1;
		КонецЕсли;
		
		ОбменМаркетПлейс.ОбработатьСозданиеДокументовПоПредварительнымЗаказамКлиента(ПараметрыОбработки,
			ТаблицаДанныхПоЗаказам, ДеньДатыОтгрузки, "ИДЗаказа");
		// Ихсанов Д. А. Конец 18.06.2026
	КонецЦикла;
	
КонецПроцедуры // СоздатьДокументыЗаказовИНакладных()

// Процедура - Заполнить документы данными сервиса
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура с параметрами обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура ЗаполнитьДокументыДаннымиСервиса(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	// Ихсанов Д. А. Начало 23.06.2026 Изменение 0000000147 от 09.06.2026 7:50:49: e1cib/data/Документ.Изменение?ref=89690050568f680711f163bec84d8034
	Запрос = Новый Запрос(ОбменМаркетПлейс.ТекстЗапросаЗаполнитьДокументыДаннымиСервиса());
	// Ихсанов Д. А. Конец 23.06.2026
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СостояниеУКлиента", ПараметрыОбработки.ХешТаблицаСтатусов["cancelled;posting_canceled"]);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ДокументОбъектЗаказКлиентаFBS = Выборка.Ссылка.ПолучитьОбъект();
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПараметрыОтбора = Новый Структура();
			ПараметрыОтбора.Вставить("НомерЗаказа", ВыборкаДетальныеЗаписи.НомерЗаказа);
			
			НайденныеСтроки = ДокументОбъектЗаказКлиентаFBS.Товары.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для каждого СтрокаТабличнойЧасти из НайденныеСтроки Цикл
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыборкаДетальныеЗаписи)
				КонецЦикла
			КонецЕсли
		КонецЦикла;
		
		ДокументОбъектЗаказКлиентаFBS.Записать();
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДокументыДаннымиСервиса()

// Процедура - Привязать документы к заказам
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура с параметрами обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура ПривязатьДокументыКЗаказам(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ЗаказКлиентаFBSТовары.Ссылка ЕСТЬ NULL
	|				ТОГДА ЗаказКлиентаFBSТовары.Ссылка
	|			КОГДА НЕ ПредварительныйЗаказКлиентаТовары.Ссылка ЕСТЬ NULL
	|				ТОГДА ПредварительныйЗаказКлиентаТовары.Ссылка
	|			ИНАЧЕ вт_СериализированныеДанныеЗаказов.Документ
	|		КОНЕЦ) КАК Документ,
	|	МП_ДанныеЗаказовСервиса.МаркетПлейс КАК МаркетПлейс,
	|	вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор КАК ВнешнийИдентификатор,
	|	вт_СериализированныеДанныеЗаказов.ДатаСоздания КАК ДатаСоздания,
	|	вт_СериализированныеДанныеЗаказов.Сумма КАК Сумма,
	|	вт_СериализированныеДанныеЗаказов.ДатаОтгрузки КАК ДатаОтгрузки,
	|	вт_СериализированныеДанныеЗаказов.Интервал КАК Интервал,
	// Ихсанов Д. А. Начало 07.07.2026 Изменение 0000000087 от 07.06.2026 22:19:02: e1cib/data/Документ.Изменение?ref=89690050568f680711f162a5bd350d2d
	|	вт_СериализированныеДанныеЗаказов.ЗаказПоЮрЛицу КАК ЗаказПоЮрЛицу
	// Ихсанов Д. А. Конец 07.07.2026
	|ИЗ
	|	вт_СериализированныеДанныеЗаказов КАК вт_СериализированныеДанныеЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МП_ДанныеЗаказовСервиса КАК МП_ДанныеЗаказовСервиса
	|		ПО вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор = МП_ДанныеЗаказовСервиса.ВнешнийИдентификатор
	|			И (МП_ДанныеЗаказовСервиса.МаркетПлейс = &МаркетПлейс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|		ПО вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор = ЗаказКлиентаFBSТовары.РИД
	|			И (НЕ ЗаказКлиентаFBSТовары.Ссылка.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительныйЗаказКлиента.Товары КАК ПредварительныйЗаказКлиентаТовары
	|		ПО вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор = ПредварительныйЗаказКлиентаТовары.РИД
	|			И (НЕ ПредварительныйЗаказКлиентаТовары.Ссылка.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	МП_ДанныеЗаказовСервиса.МаркетПлейс,
	|	вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор,
	|	вт_СериализированныеДанныеЗаказов.ДатаСоздания,
	|	вт_СериализированныеДанныеЗаказов.Сумма,
	|	вт_СериализированныеДанныеЗаказов.ДатаОтгрузки,
	|	вт_СериализированныеДанныеЗаказов.Интервал,
	// Ихсанов Д. А. Начало 07.07.2026 Изменение 0000000087 от 07.06.2026 22:19:02: e1cib/data/Документ.Изменение?ref=89690050568f680711f162a5bd350d2d
	|	вт_СериализированныеДанныеЗаказов.ЗаказПоЮрЛицу");
	// Ихсанов Д. А. Конец 07.07.2026
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МаркетПлейс", ПараметрыОбработки.МаркетПлейс);
	
	НаборЗаписей = РегистрыСведений.МП_ДанныеЗаказовСервиса.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.МаркетПлейс.Установить(ПараметрыОбработки.МаркетПлейс);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры // ПривязатьДокументыКЗаказам()

// Выполнить распределение товаров.
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура с параметрами обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура ВыполнитьРаспределениеТоваров(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	Лимит = 100;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор КАК ВнешнийИдентификатор,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки
	|ПОМЕСТИТЬ вт_ДанныеЗаказовНаРаспределение
	|ИЗ
	|	вт_СериализированныеДанныеЗаказов КАК вт_СериализированныеДанныеЗаказов
	|ГДЕ
	|	вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор1 ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДанныеЗаказовНаРаспределение.ВнешнийИдентификатор КАК ВнешнийИдентификатор,
	|	ВЫРАЗИТЬ((вт_ДанныеЗаказовНаРаспределение.НомерСтроки - 1) / &ЕмкостьПорции + 0.5 КАК ЧИСЛО(10, 0)) КАК НомерПорции
	|ИЗ
	|	вт_ДанныеЗаказовНаРаспределение КАК вт_ДанныеЗаказовНаРаспределение
	|ИТОГИ ПО
	|	НомерПорции");
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ЕмкостьПорции", Лимит);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		МассивНомеровЗаказов = Новый Массив;
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивНомеровЗаказов.Добавить(ВыборкаДетальныеЗаписи.ВнешнийИдентификатор);
		КонецЦикла;
		
		ПараметрыОбработки.ДополнительныеПараметры.Json = Новый Структура;
		ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("filter", Новый Структура);
		ПараметрыОбработки.ДополнительныеПараметры.Json.filter.Вставить("order_numbers", МассивНомеровЗаказов);
		ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("limit", Лимит);
		ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("cursor", "");
		
		СтруктураДанныхОтвета = КоннекторHTTP.Post(СтрШаблон("https://%1%2", РеквизитыМаркетПлейс.Host,
			МП_АдресЗапроса_СписокЗаказов()),, ПараметрыОбработки.ДополнительныеПараметры);
		ДанныеОтвета = КоннекторHTTP.КакJson(СтруктураДанныхОтвета,
			ПараметрыОбработки.ДополнительныеПараметры.ПараметрыПреобразованияJSON);
		Если СтруктураДанныхОтвета.КодСостояния > 400 Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого ДанныеЗаказа из ДанныеОтвета.postings Цикл
			ПараметрыОбработки.ДополнительныеПараметры.Json = Новый Структура;
			ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("posting_number", ДанныеЗаказа.posting_number);
			ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("postings", Новый Массив);
			
			Для каждого ДанныеТовара из ДанныеЗаказа.products Цикл
				Для НомерЭкземпляра = 1 По ДанныеТовара.quantity Цикл
					ДанныеЭкземпляра = Новый Структура;
					ДанныеЭкземпляра.Вставить("product_id", ДанныеТовара.sku);
					ДанныеЭкземпляра.Вставить("quantity", 1);
					
					ПараметрыОбработки.ДополнительныеПараметры.Json.postings.Добавить(ДанныеЭкземпляра);
				КонецЦикла;
			КонецЦикла;
			
			СтруктураДанныхОтвета = КоннекторHTTP.Post(СтрШаблон("https://%1%2", РеквизитыМаркетПлейс.Host,
				МП_АдресЗапроса_РазделитьЗаказНаОтправления()),, ПараметрыОбработки.ДополнительныеПараметры);
			ДанныеОтвета = КоннекторHTTP.КакJson(СтруктураДанныхОтвета,
				ПараметрыОбработки.ДополнительныеПараметры.ПараметрыПреобразованияJSON);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьРаспределениеТоваров()

// Процедура - Сформировать этикетки для посылок
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура параметров обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура СформироватьЭтикеткиДляПосылок(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.МП_ДанныеНоменклатурыЗаказовСервиса КАК МП_ДанныеНоменклатурыЗаказовСервиса
	|ГДЕ
	|	НЕ МП_ДанныеНоменклатурыЗаказовСервиса.ЭтикеткаСформирована
	|	И МП_ДанныеНоменклатурыЗаказовСервиса.МаркетПлейс = &МаркетПлейс");
	Запрос.УстановитьПараметр("МаркетПлейс", ПараметрыОбработки.МаркетПлейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПолныйПутьКФайлуЭтикетки = Выборка.ПутьКЭтикетке;
		
		Файл = Новый Файл(ПолныйПутьКФайлуЭтикетки);
		Если Файл.Существует() И Файл.Размер() > 1000 Тогда
			МенеджерЗаписи = РегистрыСведений.МП_ДанныеНоменклатурыЗаказовСервиса.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.МаркетПлейс = ПараметрыОбработки.МаркетПлейс;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.ЭтикеткаСформирована = Истина;
				МенеджерЗаписи.ПутьКЭтикетке		= ПолныйПутьКФайлуЭтикетки;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
			Продолжить
		КонецЕсли;
		
		ПутьКПапкеСЭтикетками = РеквизитыМаркетПлейс.КаталогДляЭтикеток;
		Если Не ЗначениеЗаполнено(ПутьКПапкеСЭтикетками) Тогда
			ПутьКПапкеСЭтикетками = "\\srvfiles\1C_Logs_MarketPlace\";
		КонецЕсли;
		ПутьКПапкеСЭтикетками = "\\srvfile-sk\FBS\";
		
		ПолныйПутьКФайлуЭтикетки = СтрШаблон("%1%2.pdf", ПутьКПапкеСЭтикетками, Выборка.НомерЗаказа);
		 
		Файл = Новый Файл(ПолныйПутьКФайлуЭтикетки);
		Если Файл.Существует() И Файл.Размер() > 1000 Тогда
			МенеджерЗаписи = РегистрыСведений.МП_ДанныеНоменклатурыЗаказовСервиса.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.МаркетПлейс = ПараметрыОбработки.МаркетПлейс;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.ЭтикеткаСформирована = Истина;
				МенеджерЗаписи.ПутьКЭтикетке		= ПолныйПутьКФайлуЭтикетки;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
			Продолжить
		КонецЕсли;
		
		ПараметрыОбработки.ДополнительныеПараметры.Json = Новый Структура;
		ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("posting_number", Новый Массив);
		ПараметрыОбработки.ДополнительныеПараметры.Json.posting_number.Добавить(Выборка.НомерЗаказа);
		
		СтруктураДанныхОтвета = КоннекторHTTP.Post(СтрШаблон("https://%1%2", РеквизитыМаркетПлейс.Host,
				МП_АдресЗапроса_Этикетки()),, ПараметрыОбработки.ДополнительныеПараметры);
		Если Не СтруктураДанныхОтвета.Свойство("КодСостояния")
			Или СтруктураДанныхОтвета.КодСостояния >= 400 Тогда
			СообщитьИзМодуля("Возникла ошибка при получении этикетки");
			
			Продолжить
		КонецЕсли;
		
		КоннекторHTTP.КакДвоичныеДанные(СтруктураДанныхОтвета).Записать(ПолныйПутьКФайлуЭтикетки);
		
		МенеджерЗаписи = РегистрыСведений.МП_ДанныеНоменклатурыЗаказовСервиса.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.МаркетПлейс = ПараметрыОбработки.МаркетПлейс;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.ЭтикеткаСформирована = Истина;
			МенеджерЗаписи.ПутьКЭтикетке = ПолныйПутьКФайлуЭтикетки;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // СформироватьЭтикеткиДляПосылок()

// Процедура - Обработать отмену заказов
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура параметров обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура ОбработатьОтменуЗаказов(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	Запрос = Новый Запрос(ОбменМаркетПлейс.ТекстЗапросаДанныеДляОтменыДокументов());
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Статус",		 "cancelled");
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаказFBSОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", Выборка.Номенклатура);
		ПараметрыОтбора.Вставить("НомерЗаказа", Выборка.НомерЗаказа);
		
		НайденныеСтроки = ЗаказFBSОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для каждого СтрокаТаблицыТоваров из НайденныеСтроки Цикл
				СтрокаТаблицыТоваров.Количество		= 0;
				СтрокаТаблицыТоваров.Отменен		= Истина;
				СтрокаТаблицыТоваров.ПереданоНаСайт = Истина;
			КонецЦикла;
		КонецЕсли;
		
		Если Не ЗаказFBSОбъект.Модифицированность() Тогда
			Продолжить
		КонецЕсли;
		
		РежимЗаписи = РежимЗаписиДокумента.Запись;
		Если ЗаказFBSОбъект.Проведен Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли;
		ЗаказFBSОбъект.Записать(РежимЗаписи);
	КонецЦикла;
	
	// ВРЕМЕННОЕ РЕШЕНИЕ ДЛЯ СОВМЕЩЕНИЯ СТАРОГО И НОВОГО ФУНКЦИОНАЛА
//	ОбменМаркетПлейс.ЯндексМаркет_ОтправитьДанныеОбОтменахНаСайт(ПараметрыОбработки.Маркетплейс);
	
КонецПроцедуры // ОбработатьОтменуЗаказов()

// Процедура - Обработать подтверждение заказов
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура параметров обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура ОбработатьПодтверждениеЗаказов(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_СериализированныеДанныеЗаказов.НомерЗаказа КАК НомерЗаказа,
	|	вт_СериализированныеДанныеЗаказов.ШККонтрагента КАК ШККонтрагента,
	|	вт_СериализированныеДанныеЗаказов.Количество КАК Количество
	|ИЗ
	|	вт_СериализированныеДанныеЗаказов КАК вт_СериализированныеДанныеЗаказов
	|ГДЕ
	|	вт_СериализированныеДанныеЗаказов.Статус = &Статус");
	Запрос.УстановитьПараметр("Статус", "awaiting_packaging");
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураЭкземпляраТовара = Новый Структура;
		СтруктураЭкземпляраТовара.Вставить("product_id", Выборка.ШККонтрагента);
		СтруктураЭкземпляраТовара.Вставить("quantity", Выборка.Количество);
		
		СтруктураДанныхТоваров = Новый Структура;
		СтруктураданныхТоваров.Вставить("products", Новый Массив);
		СтруктураДанныхТоваров.products.Добавить(СтруктураЭкземпляраТовара);
		
		ПараметрыОбработки.ДополнительныеПараметры.Json = Новый Структура;
		ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("packages", Новый Массив);
		ПараметрыОбработки.ДополнительныеПараметры.Json.packages.Добавить(СтруктураДанныхТоваров);
		ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("posting_number", Выборка.НомерЗаказа);

		СтруктураДанныхОтвета = КоннекторHTTP.Post(СтрШаблон("https://%1%2", РеквизитыМаркетПлейс.Host,
				МП_АдресЗапроса_СобратьЗаказ()),, ПараметрыОбработки.ДополнительныеПараметры);
		Если Не СтруктураДанныхОтвета.Свойство("КодСостояния")
			Или СтруктураДанныхОтвета.КодСостояния > 400 Тогда
			СообщитьИзМодуля("Возникла ошибка при подтверждении заказа");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ОбработатьПодтверждениеЗаказов()

#КонецЕсли

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция - МП Параметры обработки
// Возвращает структуру параметров обработки данных сервиса Яндекс Маркет
// 
// Возвращаемое значение:
//  Структура - М п параметры обработки:
// * МаркетПлейс - СправочникСсылка.ИнетМагазины - ссылка на справочник ИнетМагазины.
// * ДатаЗапроса - Дата - Текущая дата запроса.
// * ДатаНачала - Дата - дата начала периода запроса данных сервиса.
// * ДатаОкончания - Дата - дата окончания периода запроса данных сервиса.
// * МенеджерОбъекта - ОбработкаОбъект.МП_ММ_МагнитМаркет, Неопределено - менеджер объекта обработки.
// * МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц
// * ХешТаблицаСтатусов - Соответствие из Строка - хештаблицы статусов
// * ДополнительныеПараметры - Структура - дополнительные параметры
// * ИменаСтруктурДанных - Структура - имена структур данных
// * ИменаПолей - Структура - имена полей
// * ИменаПолейТоваров - Структура - имена полей товаров
// * ПоляТовараИзДанныхЗаказа - Структура - поля товара из данных заказа
// * АгрегируемыеПоля - Структура - агрегируемые поля
// * АгрегируемыеПоляТовара - Структура - агрегируемые поля товара
// * ПолеСоответствияКодаТовара - Строка - поле соответствия кода товара в матрице
Функция МП_ПараметрыОбработки() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МаркетПлейс", Справочники.ИнетМагазины.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДатаЗапроса", ТекущаяДатаСеанса());
	СтруктураПараметров.Вставить("ДатаНачала", Дата(1, 1, 1));
	СтруктураПараметров.Вставить("ДатаОкончания", Дата(1, 1, 1));
	СтруктураПараметров.Вставить("МенеджерОбъекта", Неопределено);
	СтруктураПараметров.Вставить("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц);
	СтруктураПараметров.Вставить("ХешТаблицаСтатусов", Новый Соответствие);
	СтруктураПараметров.Вставить("ДополнительныеПараметры", Новый Структура);
	СтруктураПараметров.Вставить("ИменаСтруктурДанных", Новый Структура);
	СтруктураПараметров.Вставить("ИменаПолей", Новый Структура);
	СтруктураПараметров.Вставить("ИменаПолейТоваров", Новый Структура);
	СтруктураПараметров.Вставить("ПоляТовараИзДанныхЗаказа", Новый Структура);
	СтруктураПараметров.Вставить("АгрегируемыеПоля", Новый Структура);
	СтруктураПараметров.Вставить("АгрегируемыеПоляТовара", Новый Структура);
	// Ихсанов Д. А. Начало 25.06.2026 Изменение 0000000221 от 25.06.2026 13:13:13: e1cib/data/Документ.Изменение?ref=89690050568f680711f1707e79109a75
	СтруктураПараметров.Вставить("ПолеСоответствияКодаТовара", "");
	// Ихсанов Д. А. Конец 25.06.2026
	
	Возврат СтруктураПараметров;
	
КонецФункции // МП_ПараметрыОбработки()

// Процедура - МП Заполнить параметры обработки
// Заполняет параметры стандартными стандартными значениями текущего объекта.
// 
// Параметры:
//  СтруктураПараметров - Структура
Процедура МП_ЗаполнитьПараметрыОбработки(СтруктураПараметров) Экспорт
	
	// Общие настройки для работы в модели сервиса
	СтруктураПараметров.ДополнительныеПараметры	   = КоннекторHTTP.НовыеПараметры();
	
	// Инициализируем параметры библиотеки
	СтруктураПараметров.ДополнительныеПараметры.Заголовки =
		ОбменМаркетПлейс.ПолучитьЗаголовкиОзон(СтруктураПараметров.МаркетПлейс);
	СтруктураПараметров.ДополнительныеПараметры.ПараметрыПреобразованияJSON.ВариантЗаписиДатыJSON =
		ВариантЗаписиДатыJSON.ЛокальнаяДата;
	СтруктураПараметров.ДополнительныеПараметры.ПараметрыПреобразованияJSON.ПрочитатьВСоответствие = Ложь;
	СтруктураПараметров.ДополнительныеПараметры.ПараметрыПреобразованияJSON.ИменаСвойствСоЗначениямиДата =
		СтрРазделить("in_process_at,shipment_date", ",");
	
	// Ихсанов Д. А. Начало 25.06.2026 Изменение 0000000221 от 25.06.2026 13:13:13: e1cib/data/Документ.Изменение?ref=89690050568f680711f1707e79109a75
	СтруктураПараметров.ПолеСоответствияКодаТовара = "АртикулКонтрагента";
	// Ихсанов Д. А. Конец 25.06.2026
	
	// Инициализируем параметры заполнения данных по заказу
	СтруктураПараметров.ИменаСтруктурДанных.Вставить("ТелоЗаказа", "postings");
	СтруктураПараметров.ИменаСтруктурДанных.Вставить("Товары", "products");
	
	СтруктураПараметров.ИменаПолей.Вставить("ВнешнийИдентификатор", "order_number");
	СтруктураПараметров.ИменаПолей.Вставить("ДатаСоздания", "in_process_at");
	СтруктураПараметров.ИменаПолей.Вставить("ДатаОтгрузки", "shipment_date");
	СтруктураПараметров.ИменаПолей.Вставить("ЗаказПоЮрЛицу", "analytics_data.is_legal");
	
	СтруктураПараметров.ИменаПолейТоваров.Вставить("Идентификатор", "offer_id");
	СтруктураПараметров.ИменаПолейТоваров.Вставить("ШККонтрагента", "sku");
	СтруктураПараметров.ИменаПолейТоваров.Вставить("Количество", "quantity");
	СтруктураПараметров.ИменаПолейТоваров.Вставить("Цена", "price.amount");
	
	СтруктураПараметров.ПоляТовараИзДанныхЗаказа.Вставить("ВнешнийИдентификатор",
		СтруктураПараметров.ИменаПолей["ВнешнийИдентификатор"]);
	СтруктураПараметров.ПоляТовараИзДанныхЗаказа.Вставить("НомерОтгрузки", "delivery_method.id");
	СтруктураПараметров.ПоляТовараИзДанныхЗаказа.Вставить("НомерПосылки", "order_id");
	СтруктураПараметров.ПоляТовараИзДанныхЗаказа.Вставить("НомерЗаказа", "posting_number");
	СтруктураПараметров.ПоляТовараИзДанныхЗаказа.Вставить("ШтрихКод", "barcodes.upper_barcode");
	СтруктураПараметров.ПоляТовараИзДанныхЗаказа.Вставить("ДополнительныйСтатус", "substatus");
	СтруктураПараметров.ПоляТовараИзДанныхЗаказа.Вставить("Статус", "status");
	
	СтруктураПараметров.АгрегируемыеПоля.Вставить("Сумма", 0);
	// Ихсанов Д. А. Начало 18.06.2026 Изменение 0000000070 от 05.06.2026 10:46:32: e1cib/data/Документ.Изменение?ref=89690050568f680711f160b2a681657e
	СтруктураПараметров.АгрегируемыеПоля.Вставить("Интервал", "");
	// Ихсанов Д. А. Конец 18.06.2026
	
	СтруктураПараметров.АгрегируемыеПоляТовара.Вставить("СостояниеУКлиента");
	
КонецПроцедуры // МП_ЗаполнитьПараметрыОбработки()

// МП Адрес запроса список заказов.
// 
// Возвращаемое значение:
//  Строка - Адрес запроса список заказов
Функция МП_АдресЗапроса_СписокЗаказов() Экспорт
	
	Возврат "/v4/posting/fbs/list";
	
КонецФункции // МП_АдресЗапроса_СписокЗаказов()

// МП адрес запроса разделить заказ на отправления.
// 
// Возвращаемое значение:
//  Строка - Адрес запроса разделить заказ на отправления
Функция МП_АдресЗапроса_РазделитьЗаказНаОтправления() Экспорт
	
	Возврат "/v1/posting/fbs/split";
	
КонецФункции // МП_АдресЗапроса_РазделитьЗаказНаОтправления()

// МП адрес запроса собрать заказ.
// 
// Возвращаемое значение:
//  Строка - Адрес запроса собрать заказ
Функция МП_АдресЗапроса_СобратьЗаказ() Экспорт
	
	Возврат "/v4/posting/fbs/ship";
	
КонецФункции // МП_АдресЗапроса_СобратьЗаказ()

// МП адрес запроса этикетки.
// 
// Возвращаемое значение:
//  Строка - Адрес запроса этикетки
Функция МП_АдресЗапроса_Этикетки() Экспорт
	
	Возврат "/v2/posting/fbs/package-label";
	
КонецФункции // МП_АдресЗапроса_Этикетки()

#КонецЕсли

#КонецОбласти
